{
    "JavaScript": {
        "Monster Search": {
            "image": "monster-search.webp",
            "alt": "Screenshot of Monster Search web app showing monster details",
            "description": "A web app that lets users look up monsters by name or ID, showing their stats, types, and abilities. Built with HTML, CSS, and JavaScript.",
            "folderName": "monster-search"
        },
        "Cash Register": {
            "image": "cash-register.webp",
            "alt": "Screenshot of Cash Register app calculating change",
            "description": "A JavaScript app that simulates a cash register by calculating change and returning the correct currency breakdown. Built with HTML, CSS, and JavaScript.",
            "folderName": "cash-register"
        },
        "US Phone Number Validator": {
            "image": "us-phone-number-validator.webp",
            "alt": "Screenshot of US Phone Number Validator input and validation result",
            "description": "A tool that checks if a number matches valid US phone formats using regex. Built with HTML, CSS, and JavaScript.",
            "folderName": "us-phone-number-validator"
        },
        "Roman Numeral Converter": {
            "image": "roman-numeral-converter.webp",
            "alt": "Screenshot of Roman Numeral Converter converting number to Roman numerals",
            "description": "An interactive tool that converts numbers into Roman numerals up to 3999. It validates input, handles edge cases, and gives instant results. Built with HTML, CSS, and JavaScript.",
            "folderName": "roman-numeral-converter"
        },
        "Palindrome Checker": {
            "image": "palindrome-checker.webp",
            "alt": "Screenshot of Palindrome Checker app showing input and result",
            "description": "A text utility that detects whether a word or phrase is a palindrome. It ignores punctuation, spaces, and capitalization, giving users instant feedback. Built with HTML, CSS, and JavaScript.",
            "folderName": "palindrome-checker"
        }
    },
    "CSS": {
        "Survey Form": {
            "image": "survey-form.webp",
            "alt": "Screenshot of Survey Form project with input fields and submit button",
            "description": "A responsive form project showcasing text fields, checkboxes, and radio buttons with clean HTML structure and CSS styling.",
            "folderName": "survey-form"
        },
        "Product Landing Page": {
            "image": "product-landing-page.webp",
            "alt": "Screenshot of Product Landing Page project with product sections and call-to-action",
            "description": "A single-page layout with sections for features, pricing, and a call-to-action. Built with semantic HTML and styled with CSS for responsiveness.",
            "folderName": "product-landing-page"
        },
        "Technical Documentation Page": {
            "image": "technical-documentation-page.webp",
            "alt": "Screenshot of Technical Documentation Page project with sidebar navigation and content",
            "description": "A documentation-style page featuring a fixed sidebar and scrollable content area. Uses HTML for structure and CSS for layout and readability.",
            "folderName": "technical-documentation-page"
        },
        "Tribute Page": {
            "image": "tribute-page.webp",
            "alt": "Screenshot of Tribute Page project with heading, image, and text content",
            "description": "A tribute page with a centered layout, image, and descriptive text. Demonstrates basic HTML semantics and simple responsive CSS design.",
            "folderName": "tribute-page"
        },
        "Portfolio Page": {
            "image": "portfolio-page.webp",
            "alt": "Screenshot of Portfolio Page project with navigation bar, welcome section, services grid, and GitHub link",
            "description": "A responsive personal portfolio mockup featuring an about section, services grid, and contact area with GitHub link. Built with HTML and CSS to demonstrate layout and responsiveness.",
            "folderName": "portfolio-page"
        }
    },
    "HTML": 0
}